Zimbo88/stm32-security-lab/firmware/common/stm32f429_memory_layout.h
/* Generated from config/stm32f429_memory_layout.json profile stm32f429_1m. */
#ifndef STM32F429_MEMORY_LAYOUT_H
#define STM32F429_MEMORY_LAYOUT_H

#define STM32F429_LAYOUT_PROFILE_STM32F429_1M 1UL
#define STM32F429_LAYOUT_PROFILE_STM32F429_2M 2UL
#define STM32F429_LAYOUT_PROFILE_ID 1UL
#define STM32F429_LAYOUT_PROFILE_NAME "stm32f429_1m"
#define STM32F429_MCU_NAME "STM32F429IGT6"

#define STM32F429_FLASH_BASE 0x08000000UL
#define STM32F429_FLASH_TOTAL_SIZE 0x00100000UL
#define STM32F429_FLASH_SIZE_KIB 1024UL
#define STM32F429_FLASH_END 0x08100000UL
#define STM32F429_FLASH_BANK1_BASE 0x08000000UL
#define STM32F429_FLASH_BANK1_SIZE 0x00100000UL
#define STM32F429_FLASH_BANK1_END 0x08100000UL
#define STM32F429_FLASH_BANK2_BASE 0x08100000UL
#define STM32F429_FLASH_BANK2_SIZE 0x00000000UL
#define STM32F429_FLASH_BANK2_END 0x08100000UL

#define STM32F429_FLASH_SECTOR_COUNT 12UL

#define STM32F429_FLASH_SECTOR_0_BANK 1UL
#define STM32F429_FLASH_SECTOR_0_BASE 0x08000000UL
#define STM32F429_FLASH_SECTOR_0_SIZE 0x00004000UL
#define STM32F429_FLASH_SECTOR_0_END 0x08004000UL

#define STM32F429_FLASH_SECTOR_1_BANK 1UL
#define STM32F429_FLASH_SECTOR_1_BASE 0x08004000UL
#define STM32F429_FLASH_SECTOR_1_SIZE 0x00004000UL
#define STM32F429_FLASH_SECTOR_1_END 0x08008000UL

#define STM32F429_FLASH_SECTOR_2_BANK 1UL
#define STM32F429_FLASH_SECTOR_2_BASE 0x08008000UL
#define STM32F429_FLASH_SECTOR_2_SIZE 0x00004000UL
#define STM32F429_FLASH_SECTOR_2_END 0x0800C000UL

#define STM32F429_FLASH_SECTOR_3_BANK 1UL
#define STM32F429_FLASH_SECTOR_3_BASE 0x0800C000UL
#define STM32F429_FLASH_SECTOR_3_SIZE 0x00004000UL
#define STM32F429_FLASH_SECTOR_3_END 0x08010000UL

#define STM32F429_FLASH_SECTOR_4_BANK 1UL
#define STM32F429_FLASH_SECTOR_4_BASE 0x08010000UL
#define STM32F429_FLASH_SECTOR_4_SIZE 0x00010000UL
#define STM32F429_FLASH_SECTOR_4_END 0x08020000UL

#define STM32F429_FLASH_SECTOR_5_BANK 1UL
#define STM32F429_FLASH_SECTOR_5_BASE 0x08020000UL
#define STM32F429_FLASH_SECTOR_5_SIZE 0x00020000UL
#define STM32F429_FLASH_SECTOR_5_END 0x08040000UL

#define STM32F429_FLASH_SECTOR_6_BANK 1UL
#define STM32F429_FLASH_SECTOR_6_BASE 0x08040000UL
#define STM32F429_FLASH_SECTOR_6_SIZE 0x00020000UL
#define STM32F429_FLASH_SECTOR_6_END 0x08060000UL

#define STM32F429_FLASH_SECTOR_7_BANK 1UL
#define STM32F429_FLASH_SECTOR_7_BASE 0x08060000UL
#define STM32F429_FLASH_SECTOR_7_SIZE 0x00020000UL
#define STM32F429_FLASH_SECTOR_7_END 0x08080000UL

#define STM32F429_FLASH_SECTOR_8_BANK 1UL
#define STM32F429_FLASH_SECTOR_8_BASE 0x08080000UL
#define STM32F429_FLASH_SECTOR_8_SIZE 0x00020000UL
#define STM32F429_FLASH_SECTOR_8_END 0x080A0000UL

#define STM32F429_FLASH_SECTOR_9_BANK 1UL
#define STM32F429_FLASH_SECTOR_9_BASE 0x080A0000UL
#define STM32F429_FLASH_SECTOR_9_SIZE 0x00020000UL
#define STM32F429_FLASH_SECTOR_9_END 0x080C0000UL

#define STM32F429_FLASH_SECTOR_10_BANK 1UL
#define STM32F429_FLASH_SECTOR_10_BASE 0x080C0000UL
#define STM32F429_FLASH_SECTOR_10_SIZE 0x00020000UL
#define STM32F429_FLASH_SECTOR_10_END 0x080E0000UL

#define STM32F429_FLASH_SECTOR_11_BANK 1UL
#define STM32F429_FLASH_SECTOR_11_BASE 0x080E0000UL
#define STM32F429_FLASH_SECTOR_11_SIZE 0x00020000UL
#define STM32F429_FLASH_SECTOR_11_END 0x08100000UL


#define STM32F429_BOOTLOADER_BASE 0x08000000UL
#define STM32F429_BOOTLOADER_SIZE 0x00008000UL
#define STM32F429_BOOTLOADER_END 0x08008000UL
#define STM32F429_BOOTLOADER_FIRST_SECTOR 0UL
#define STM32F429_BOOTLOADER_LAST_SECTOR 1UL

#define STM32F429_BOOT_METADATA_FORMAT_VERSION 1UL
#define STM32F429_BOOT_METADATA_RECORD_SIZE 0x00000080UL

#define STM32F429_BOOT_METADATA_A_BASE 0x08008000UL
#define STM32F429_BOOT_METADATA_A_SIZE 0x00004000UL
#define STM32F429_BOOT_METADATA_A_END 0x0800C000UL
#define STM32F429_BOOT_METADATA_A_FIRST_SECTOR 2UL
#define STM32F429_BOOT_METADATA_A_LAST_SECTOR 2UL

#define STM32F429_BOOT_METADATA_B_BASE 0x0800C000UL
#define STM32F429_BOOT_METADATA_B_SIZE 0x00004000UL
#define STM32F429_BOOT_METADATA_B_END 0x08010000UL
#define STM32F429_BOOT_METADATA_B_FIRST_SECTOR 3UL
#define STM32F429_BOOT_METADATA_B_LAST_SECTOR 3UL

#define STM32F429_UPDATE_METADATA_BASE 0x08010000UL
#define STM32F429_UPDATE_METADATA_SIZE 0x00010000UL
#define STM32F429_UPDATE_METADATA_END 0x08020000UL
#define STM32F429_UPDATE_METADATA_FIRST_SECTOR 4UL
#define STM32F429_UPDATE_METADATA_LAST_SECTOR 4UL

#define STM32F429_SLOT_A_ID 0UL
#define STM32F429_SLOT_A_SIGNED_IMAGE_BASE 0x08020000UL
#define STM32F429_SLOT_A_MANIFEST_BASE 0x08020000UL
#define STM32F429_SLOT_A_SIGNATURE_BASE 0x08020060UL
#define STM32F429_SLOT_A_PAYLOAD_BASE 0x08020200UL
#define STM32F429_SLOT_A_END 0x08080000UL
#define STM32F429_SLOT_A_SIZE 0x00060000UL
#define STM32F429_SLOT_A_PAYLOAD_MAX_SIZE 0x0005FE00UL
#define STM32F429_SLOT_A_FIRST_SECTOR 5UL
#define STM32F429_SLOT_A_LAST_SECTOR 7UL

#define STM32F429_SLOT_B_ID 1UL
#define STM32F429_SLOT_B_SIGNED_IMAGE_BASE 0x08080000UL
#define STM32F429_SLOT_B_MANIFEST_BASE 0x08080000UL
#define STM32F429_SLOT_B_SIGNATURE_BASE 0x08080060UL
#define STM32F429_SLOT_B_PAYLOAD_BASE 0x08080200UL
#define STM32F429_SLOT_B_END 0x080E0000UL
#define STM32F429_SLOT_B_SIZE 0x00060000UL
#define STM32F429_SLOT_B_PAYLOAD_MAX_SIZE 0x0005FE00UL
#define STM32F429_SLOT_B_FIRST_SECTOR 8UL
#define STM32F429_SLOT_B_LAST_SECTOR 10UL

#define STM32F429_RECOVERY_BASE 0x080E0000UL
#define STM32F429_RECOVERY_SIZE 0x00020000UL
#define STM32F429_RECOVERY_END 0x08100000UL
#define STM32F429_RECOVERY_FIRST_SECTOR 11UL
#define STM32F429_RECOVERY_LAST_SECTOR 11UL

#define STM32F429_SIGNED_IMAGE_BASE 0x08020000UL
#define STM32F429_SIGNED_MANIFEST_SIZE 0x00000060UL
#define STM32F429_SIGNED_SIGNATURE_SIZE 0x00000040UL
#define STM32F429_SIGNED_IMAGE_HEADER_SIZE 0x00000200UL
#define STM32F429_SIGNATURE_BASE 0x08020060UL

#define STM32F429_APPLICATION_BASE 0x08020200UL
#define STM32F429_APPLICATION_FLASH_END 0x08080000UL
#define STM32F429_APPLICATION_PAYLOAD_MAX_SIZE 0x0005FE00UL
#define STM32F429_APPLICATION_MIN_PAYLOAD_SIZE 0x00000008UL

#define STM32F429_SIGNED_IMAGE_FLAGS_ALLOWED_MASK 0x00000000UL

#define STM32F429_MAIN_SRAM_BASE 0x20000000UL
#define STM32F429_MAIN_SRAM_SUPPORTED_SIZE 0x00020000UL
#define STM32F429_MAIN_SRAM_SUPPORTED_END 0x20020000UL
#define STM32F429_MAIN_SRAM_DEVICE_SIZE 0x00040000UL
#define STM32F429_MAIN_SRAM_DEVICE_END 0x20040000UL

#define STM32F429_APPLICATION_MSP_BASE 0x20000000UL
#define STM32F429_APPLICATION_MSP_END 0x20020000UL
#define STM32F429_APPLICATION_MSP_ALIGNMENT 0x00000008UL

#define STM32F429_CCM_BASE 0x10000000UL
#define STM32F429_CCM_SIZE 0x00010000UL
#define STM32F429_CCM_END 0x10010000UL
#define STM32F429_CCM_APPLICATION_SUPPORTED 0U
#define STM32F429_SRAM_EXECUTION_SUPPORTED 0U

#endif
